      const authors = [
        {
          name: "廖本恩",
          image: "作者照片/1廖本恩.jpg",
          bio: "中國神學研究院中國文化研究中心研究員（義務）、中國神學研究院神學碩士畢業；喜愛探索東亞各國的流行、文化與歷史，並樂意向人分享發生在東亞各國間的基督教群體故事。",
          link: "個別作者/1廖本恩.html",
        },
        {
          name: "張辰瑋",
          image: "作者照片/2張辰瑋.jpg",
          bio: "無教會者、衛理公會會友，佛教徒。不太喜歡待在別人設定好的框架中，帶有某種知性反骨的怪癖，最喜歡做的事就是成為跨界的橋樑。目前比較關注的領域有宗教、性別、民主、科技，台灣在這四個領域剛好都是亞洲No.1（或名列前茅），所以我的夢想是透過這四個領域的跨界對話，成為台灣的思想家。",
          link: "個別作者/2張辰瑋.html",
        },
        {
          name: "邱詠恩",
          image: "作者照片/3邱詠恩.jpg",
          bio: "在長老教會聚會的非信徒，信仰認同為不可知論者。跟教會、神學之間的關係很微妙，覺得這方面自己有點像芙莉蓮的弟子費倫，她對於魔法的態度 ── 不是因為真的很有興趣而參與其中，而是因為遇見了有趣的人、有趣的關係，又剛好有一點點堪用的才能，所以願意參與其中。",
          link: "個別作者/3邱詠恩.html",
        },
        {
          name: "奧斯定",
          image: "作者照片/4奧斯定.jpg",
          bio: "三年資歷的東正教徒。以聖奧斯定這位西方教父的名字當作受洗名，期許自己能成為連結東西方教會的一座橋樑。",
          link: "個別作者/4奧斯定.html",
        },
        {
          name: "金子煥",
          image: "作者照片/5金子煥.jpg",
          bio: "歷史、哲學、文學、非福音派基督徒。台灣神學研究學院神學研究道學碩士，現在是雜誌執行編輯。因不滿足於後現代神學這個階段，故成立「野橄欖神學社」，期盼能發展出自己這個世代的神學論述。",
          link: "個別作者/5金子煥.html",
        },
        {
          name: "小無",
          image: "作者照片/6小無.jpg",
          bio: "小無的無，是空空著磨、無能為力的無。人可以不信上帝，但絕對不能相信努力。如果信仰與文學本質無異，都是文本與文本的對話。那在不斷被解構又不斷被定義的每一個世界中，我只能繼續離經叛道。畢竟，你我都還存在於彼此正改變的先前與往後之中。",
          link: "個別作者/6小無.html",
        },
        {
          name: "陳思豪牧師",
          image: "作者照片/7陳思豪牧師.jpg",
          bio: "現任台北三一長老教會牧師，同時擔任「沒有名字的教會」顧問牧師，長期關注同志信仰關懷、教會改革與公共議題的對話。在此之前，曾牧養古亭長老教會，並於台灣基督長老教會台北大專中心擔任大專工作者多年，陪伴無數青年走過信仰與人生的交會路口。<br>深信牧養的本質是與人同行、為弱勢發聲，也是持續尋問「教會為誰而存在」的實踐者。",
          link: "個別作者/7陳思豪牧師.html",
        },
        {
          name: "Sunny Leung",
          image: "作者照片/8Sunny Leung.jpg",
          bio: "國立高雄師範大學性別教育研究所碩士生，研究興趣為性別與宗教相關的議題。性解放分子，有穩定交往對象，同時愛約帥哥打炮的男同性戀者。2024年12月正式從浸信會遷移會籍到台灣基督長老教會，現為高雄羅雅教會的會友，被友人戲稱為「教會的衝組」。",
          link: "個別作者/8Sunny Leung.html",
        },
        {
          name: "張劭瑋",
          image: "作者照片/9張劭瑋.jpg",
          bio: "宗教多元主義者，由地方教會改宗長老教會再領洗成為天主教徒，同時皈依三寶成為佛教徒，並受持菩薩戒。從小在臺北長大，目前跟老婆住在鄉下實踐民間信仰敘事與本土意識，未來即將成為兩個孩子的爸。",
          link: "個別作者/9張劭瑋.html",
        },
        {
          name: "毛毛",
          image: "作者照片/10毛毛.JPG",
          bio: "在傳統基督教家庭長大的第四代基督徒，遊走於不同的教會，尋找着如何能治癒因為教會而受傷的心靈。",
          link: "個別作者/10毛毛.html",
        },
        {
          name: "溫金柯老師",
          image: "作者照片/11溫金柯老師.jpg",
          bio: "政治大學哲學系畢業，文化大學哲學研究所碩士，輔仁大學宗教研究所博士班肄業。中央廣播電台資深記者、節目製作人。長期以業餘身份從事佛教學研究。一九八九年加入現代禪教團，歷任《現代禪雜誌》總編輯、社長、教理哲學研究部主任等職。",
          link: "個別作者/11溫金柯老師.html",
        },
        {
          name: "談良辰老師",
          image: "作者照片/12談良辰老師.jpg",
          bio: "輔仁聖博敏神學院神學碩士，輔仁大學哲學博士。在台灣聖公會三一書院擔任講師。奉行一生的哲學為：「喜歡不為人知，或讓人認為自己不算什麼。」",
          link: "個別作者/12談良辰老師.html",
        },
        {
          name: "等融法師",
          image: "作者照片/13等融法師.jpeg",
          bio: "佛教弘誓學院法師，師從上昭下慧長老尼。美國加州大學柏克萊分校經濟學學士，臺灣佛光大學佛教學碩士，目前就讀於國立臺灣大學哲學系博士班。研究領域：佛教文化哲學、佛教歷史哲學、法滅思想。",
          link: "個別作者/13等融法師.html",
        },

        {
          name: "淨智",
          image: "作者照片/14淨智.jpg",
          bio: "成大歷史系畢、一名孕育於民間信仰生活的佛教徒，到了大學接觸各宗教與傳承才打開自己的眼界，興趣是以文字梳理自己對信仰的觀察體會，並與常民生活乃至其他宗教對話。期盼自己將來除了能深入學海之中，還能使自己成為推動信仰思想改變的人。",
          link: "個別作者/14淨智.html",
        },

        {
          name: "昭慧法師",
          image: "作者照片/15昭慧法師.jpg",
          bio: "佛教弘誓學院創辦人兼指導法師，關懷生命協會創會理事長，玄奘大學宗教與文化學系系主任，長年活躍於宗教界、社運界與學術界三個領域。法師素以「佛教女性主義者」聞名，為亞洲首位為同志證婚的佛教法師。",
          link: "個別作者/15昭慧法師.html",
        },

        {
          name: "盧俊義牧師",
          image: "作者照片/16盧俊義牧師.jpg",
          bio: "台灣基督長老教會牧師。1974年自台南神學院畢業，曾在台東關山、嘉義西門、台北東門等教會牧會，並兼任多所神學院講師。曾任監獄教誨師、《教會公報》主編，關懷生命協會監事／常務監事。主持過多個電視與廣播節目，著重聖經教學與信仰分享。",
          link: "個別作者/16盧俊義牧師.html",
        },

        {
          name: "曾櫳震",
          image: "作者照片/17曾櫳震.jpg",
          bio: "國立東華大學中文系學士、國立清華大學台灣語言研究所在讀。專長為形式語音學、共時客語音韻、台灣客語研究及台灣客家文化；興趣是有關佛教的哲理、莊學與醫家思想，雖然主要是佛教徒，但也喜歡觀察台灣的各個宗教。",
          link: "個別作者/17曾櫳震.html",
        },

        {
          name: "劉玉雯",
          image: "作者照片/18劉玉雯.jpeg",
          bio: "長老教會會友，畢業於國立成功大學外國語文研究所、臺南神學院，曾任國立臺灣文學館專案助理，現為南神推廣教育講師、臨安教會信息講員、自媒體工作者。",
          link: "個別作者/18劉玉雯.html",
        },

        {
          name: "王彥軒牧師",
          image: "作者照片/19王彥軒.jpeg",
          bio: "現任台灣聖公會牧師，在新竹植堂、牧會。大學在公館唸社工系和人類學系，然後到倫敦待了一年，在KCL探索基督教與藝術這個領域，最後進入台灣聖公會三一書院就讀，畢業後開始了牧職生涯。",
          link: "個別作者/19王彥軒牧師.html",
        },
      ];

      // 隨機排序函數
      function shuffle(array) {
        for (let i = array.length - 1; i > 0; i--) {
          const j = Math.floor(Math.random() * (i + 1));
          [array[i], array[j]] = [array[j], array[i]];
        }
      }

      // 將作者資訊動態插入頁面
      function displayAuthors() {
        shuffle(authors); // 將作者順序打亂
        const container = document.getElementById("authors-container");
        container.innerHTML = ""; // 清空容器

        authors.forEach((author) => {
          const authorBox = `
                    <div class="author-box">
                        <div class="author-info">
                            <div class="author-image" style="background-image: url('${author.image}')"></div>
                            <h2>${author.name}</h2>
                        </div>
                        <div class="author-bio">
                            <p>${author.bio}</p>
                            <a href="${author.link}">閱讀此作者文章</a>
                        </div>
                    </div>
                `;
          container.innerHTML += authorBox;
        });
      }

      // 初始化頁面
      window.onload = displayAuthors;
